[net]
input_channels=3

[conv]
size=3,3
stride=1
filters=32
pad=1
activation=leaky
repeat=2

[maxpool]
size=2,2
pad=1
stride=2

[conv]
size=3,3
stride=1
filters=64
pad=1
activation=leaky
repeat=2

[maxpool]
size=2,2
pad=1
stride=2

[conv]
size=3,3
stride=1
filters=128
pad=1
activation=leaky
repeat=4

[maxpool]
size=2,2
pad=1
stride=2

[conv]
size=3,3
stride=1
filters=64
pad=1
activation=leaky
repeat=7

[conv]
size=1,1
stride=1
filters=256
pad=1
activation=leaky
repeat=1

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1

[concat]
layers=-3,-1

[conv]
size=7,7
stride=1
filters=64
pad=1
activation=leaky
repeat=6

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1

[concat]
layers=-6,-1

[conv]
size=7,7
stride=1
filters=64
pad=1
activation=leaky
repeat=6

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1

[concat]
layers=-9, -1

[conv]
size=7,7
stride=1
filters=64
pad=1
activation=leaky
repeat=6

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1

[concat]
layers=-12,-1

[conv]
size=7,7
stride=1
filters=64
pad=1
activation=leaky
repeat=6

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1

[concat]
layers=-15,-1

[conv]
size=7,7
stride=1
filters=64
pad=1
activation=leaky
repeat=6

[conv]
size=1,1
stride=1
filters=2
output=1
pad=1
activation=none
repeat=1