[net]
input_channels=3

[conv]
size=3,3
filters=16
stride=1
pad=1
activation=leaky
batchnorm=1

[maxpool]
size=2
stride=2
pad=1

[conv]
size=3,3
filters=32
stride=1
pad=1
activation=leaky
batchnorm=1

[maxpool]
size=2
stride=2
pad=1

[conv]
size=15,1
filters=32
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,15
filters=32
pad=1
stride=1
activation=leaky
batchnorm=1

[concat]
layers=-3,-1

[conv]
size=27,1
filters=64
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,27
filters=64
pad=1
stride=1
activation=leaky
batchnorm=1

[shortcut]
layers=-3

[maxpool]
size=2
stride=2
pad=1

[conv]
size=15,1
filters=64
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,15
filters=64
pad=1
stride=1
activation=leaky
batchnorm=1

[concat]
layers=-2,-1

[conv]
size=3,3
filters=128
pad=1
stride=1
activation=leaky
batchnorm=1

[maxpool]
size=2
stride=2
pad=1

[conv]
size=1,1
filters=128
pad=1
stride=1
activation=leaky
batchnorm=1

[shortcut]
layers=-2

[conv]
size=11,1
filters=256
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,11
filters=256
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,1
filters=256
pad=1
stride=1
activation=leaky
batchnorm=1

[shortcut]
layers=-2

[conv]
size=1,1
filters=64
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,1
filters=32
pad=1
stride=1
activation=leaky
batchnorm=1

[conv]
size=1,1
filters=3
pad=1
stride=1
activation=leaky
batchnorm=1
