[net]   
input_channels=3

[conv]
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[conv]
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[conv]
filters=64
size=3
stride=1
pad=1
activation=leaky

[conv]
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
layers=-2,-1
activation=linear

[maxpool]
size=2
stride=2

[conv]
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[conv]
filters=128
size=1
stride=1
pad=1
activation=leaky

[shortcut]
layers=-2,-1
activation=linear

[maxpool]
size=2
stride=2

[conv]
filters=128
size=3
stride=1
pad=1
activation=leaky

[conv]
filters=256
size=3
stride=1
pad=1
activation=leaky

[conv]
size=1
stride=1
pad=1
filters=256
activation=leaky

[shortcut]
layers=-2,-1
activation=linear

[conv]
size=1
stride=1
pad=1
filters=64
activation=leaky

[conv]
size=1
stride=1
pad=1
filters=32
activation=leaky

[conv]
size=1
stride=1
pad=1
filters=4
activation=leaky
output=1