[net]
input_channels=3

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=3,3
filters=16

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=3,3
filters=32

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=15,1
filters=64

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,15
filters=64

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=10,1
filters=128

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,10
filters=128

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=20,1
filters=256

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,20
filters=256

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=10,1
filters=128

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,10
filters=128

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,1
filters=64

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,1
filters=32

[conv]
pad=0
stride=1
activation=leaky
batchnorm=1
size=1,1
filters=3

