[net]
input_channels=3

[conv]
pad=1
stride=1
size=3,3
batchnorm=1
activation=leaky
filters=9

[conv]
pad=1
stride=1
size=3,3
batchnorm=1
activation=leaky
filters=6

[conv]
pad=1
stride=1
size=3,3
batchnorm=1
activation=leaky
filters=1