[net]
input_channels=256

[conv]
filters=128
size=1
stride=1
activation=leaky

[maxpool]
from=-1
size=3
stride=2
pad=0

[conv]
from=-3
filters=32
size=1
pad=1
activation=leaky

[conv]
filters=64
stride=2
pad=0
size=3
activation=leaky

[conv]
from=-5
filters=64
size=1
pad=1
activation=leaky

[conv]
filters=64
stride=2
pad=0
size=3
activation=leaky

[conv]
from=-7
filters=64
size=1
pad=1
activation=leaky

[conv]
filters=64
size=3
pad=1
activation=leaky

[conv]
filters=128
stride=2
pad=0
size=3
activation=leaky

[concat]
layers=-8,-6,-4,-1