[net]
input_channels=128

[maxpool]
size=3
stride=2
pad=1

[conv]
from=-2
filters=64
size=3
stride=2
pad=1
activation=leaky

[conv]
from=-3
filters=48
size=1
pad=1
activation=leaky

[conv]
filters=48
size=3
pad=1
activation=leaky

[conv]
filters=64
size=3
stride=2
pad=1
activation=leaky

[concat]
layers=-5,-4,-1