[net]
input_channels=384

[conv]
size=1
filters=64
stride=1
activation=leaky

[conv]
from=-2
size=1
filters=96
stride=1
activation=leaky

[conv]
size=1,3
filters=128
stride=1
pad=1
activation=leaky

[conv]
size=3,1
filters=128
stride=1
pad=1
activation=leaky

[concat]
layers=-4,-1

[conv]
size=1
filters=384
stride=1
activation=linear
batchnorm=0

[shortcut]
layers=-7

[relu]