[net]
input_channels=128

[conv]
size=1
filters=32
stride=1
pad=1
activation=leaky

[conv]
from=-2
size=1
filters=24
stride=1
pad=1
activation=leaky

[conv]
size=3
filters=24
stride=1
pad=1
activation=leaky

[conv]
from=-4
size=1
filters=24
stride=1
pad=1
activation=leaky

[conv]
filters=32
size=3
stride=1
pad=1
activation=leaky

[conv]
size=3
filters=48
stride=1
pad=1
activation=leaky

[conv]
from=-7
size=1,7
filters=24
stride=1
pad=1
activation=leaky

[conv]
size=7,1
filters=24
stride=1
pad=1
activation=leaky

[concat]
layers=-1,-3,-6,-8

[shortcut]
layers=-10

[relu]