[net]
input_channels=256

[conv]
size=1
filters=128
stride=1
pad=1
activation=leaky

[conv]
from=-2
size=1
filters=96
stride=1
pad=1
activation=leaky

[conv]
size=1,7
filters=128
stride=1
pad=1
activation=leaky

[conv]
size=7,1
filters=128
stride=1
activation=leaky
batchnorm=1
pad=1

[shortcut]
layers=-4

[conv]
size=1
filters=256
stride=1
pad=1
activation=leaky
batchnorm=0

[shortcut]
layers=-7

[relu]