[net]
input_channels=3

[conv]
filters=16
size=3
stride=2
pad=0
activation=leaky

[conv]
filters=16
size=3
stride=1
pad=0
activation=leaky

[conv]
filters=24
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=3
stride=2
pad=0

[conv]
from=-2
filters=32
size=3
stride=2
pad=0
activation=leaky

[concat]
layers=-2,-1

[conv]
filters=24
size=1
stride=1
pad=1
activation=leaky

[conv]
filters=32
size=3
stride=1
pad=1
activation=leaky

[conv]
from=-3
filters=24
size=1
stride=1
pad=1
activation=leaky

[conv]
filters=24
size=7,1
stride=1
pad=1
activation=leaky

[conv]
filters=24
size=1,7
stride=1
pad=1
activation=leaky

[conv]
filters=32
size=3
stride=1
pad=1
activation=leaky

[concat]
layers=-5,-1

[conv]
size=3
filters=64
pad=0
stride=1
activation=leaky

[maxpool]
from=-2
size=3
stride=1
pad=0

[concat]
layers=-2,-1